src/00_intro/why_this_page.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>为什么会有本站</title>
<!-- 2021-02-21 Sun 07:46 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="杨 睿" />
</head>
<body>
<div id="content">
<h1 class="title">为什么会有本站</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 说点什么</a>
<ul>
<li><a href="#sec-1-1">1.1. 关于博客</a></li>
<li><a href="#sec-1-2">1.2. 关于这篇博客</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 问自己的问题</a>
<ul>
<li><a href="#sec-2-1">2.1. 知识的流量与存量</a></li>
<li><a href="#sec-2-2">2.2. (Toolkits &amp; Methodology) vs. Ideas</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 给自己的方寸天地</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 说点什么</h2>
<div class="outline-text-2" id="text-1">
<p>
截至今天（2021年2月21日），如果从提前实习开始，已经工作两年多了。这两年自己做了什么，付出了什么，收获了什么？我想大概也只有钉钉年报的统计数据能告诉我了，是的，我自己也说不清楚。
</p>

<p>
但我有很多想说的。
</p>
</div>


<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 关于博客</h3>
<div class="outline-text-3" id="text-1-1">
<p>
有写技术博客的习惯，嗯，曾经有。5年前吧，博客园、github、gitee、石墨笔记等等平台。乱七八糟，ID 也是五花八门（yangruipis、yangruiutf-8、yangruigit、yangruiGB2312&#x2026;），一开始需求很简单，能记东西就行。后来日趋复杂：Markdown 语法、Latex公式渲染、GTD管理、代码高亮、图片外链、云端同步、跨平台。再后来渐渐发现，很难找到一个“大一统”的工具链和平台，满足我一切需求。反而在这一过程中，陷入了工具的泥潭里，以至于被自己的努力和折腾感动。
</p>

<p>
一路走来看到很多容易被自己感动的人了，包括自己。有的人一上来和我说：
</p>

<ul class="org-ul">
<li>“学长你好！我热爱算法和编程，balabala，想请教一下后续职业规划的问题”
</li>
<li>“好啊，参加过什么比赛不，有什么项目不？”
</li>
<li>。。。
</li>
<li>。。。
</li>
</ul>

<p>
不好意思扯远了。博客在我看来，应该是内容远大于形式的东西。当然追求好的形式也说明你有一个好习惯，但是如果终日在想着形式，而没有动笔写一篇文字，那博客对你来说可能是可有可无的，有这个时间大可以干别的事情。
</p>


<p>
博客是一种沉淀，大部分时间自己看，极小部分时间归对你感兴趣的人看。你不会指望在搜索引擎上用非指向性的关键词搜索到你博客页面，大V如王垠<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>也不行。你的博客入口只会在你的简历和 github 主页上。
</p>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 关于这篇博客</h3>
<div class="outline-text-3" id="text-1-2">
<dl class="org-dl">
<dt> 这是一个很随意的博客，随意到连意识流都不算 </dt><dd>意识流好歹也是顺着自己想的走，我是跳着走，随机游走
</dd>
<dt> 这是一个 org-mode 语法、Emacs htmlize lib 为渲染后端，readtheorg 主题的博客 </dt><dd>笔者大四时通过陈斌大大的《一年成为Emacs高手(像神一样使用编辑器)》<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup> 入门 emacs，如今已过五年，还是没有成为Emacs高手，但是Emacs已经成为我不可或缺的一部分，当然这是后话了。
<ul class="org-ul">
<li>博客源码地址：<a href="https://github.com/Yangruipis/Yangruipis.github.io">https://github.com/Yangruipis/Yangruipis.github.io</a>
</li>
<li>本地编译方式： <code>./tools/build.sh</code>
</li>
<li>CI： github actions
</li>
</ul>
</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 问自己的问题</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 知识的流量与存量</h3>
</div>


<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> (Toolkits &amp; Methodology) vs. Ideas</h3>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 给自己的方寸天地</h2>
<div class="outline-text-2" id="text-3">
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<a href="https://www.yinwang.org/">当然我在扯淡 <a href="https://www.yinwang.org/">https://www.yinwang.org/</a></a>
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
<a href="https://github.com/redguardtoo/mastering-emacs-in-one-year-guide">https://github.com/redguardtoo/mastering-emacs-in-one-year-guide</a>
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: 杨 睿</p>
<p class="date">Created: 2021-02-21 Sun 07:46</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
